Tekla.Structures.Model.GridBase
The GridBase class defines the base class for grids.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
GridBase grid = MakeAGrid();
grid.IsMagnetic = true;
bool Result = grid.Insert();
}
}

Tekla.Structures.Model.GridBase.AlphaChannelMask
This constant is used to force the color to have a uniform alpha channel, since Core does not understand it

Tekla.Structures.Model.GridBase.color
The grid lines color

Tekla.Structures.Model.GridBase.fontColor
The font color for the grid labels

Tekla.Structures.Model.GridBase.#ctor
Creates a new grid instance.
The default values are as follows:
Name = "Grid";
CoordinateX = "0.00 4*3000.00";
CoordinateY = "0.00 5*6000.00";
CoordinateZ = "0.00 6000.00 8000.00 9000.00";
LabelX = "A B C D E";
LabelY = "1 2 3 4 5 6";
LabelZ = "+0 +6000 +8000 +9000";
ExtensionLeftX = 2000.0;
ExtensionLeftY = 2000.0;
ExtensionLeftZ = 2000.0;
ExtensionRightX = 2000.0;
ExtensionRightY = 2000.0;
ExtensionRightZ = 2000.0;
IsMagnetic = false;

Tekla.Structures.Model.GridBase.IsMagnetic
Gets or sets whether the grid is magnetic or not.

Tekla.Structures.Model.GridBase.Name
Gets or sets the name of the grid.

Tekla.Structures.Model.GridBase.FontSize
Gets or sets font size for the grid labels

Tekla.Structures.Model.GridBase.FontColor
Gets or sets font color for the grid labels

Tekla.Structures.Model.GridBase.Origin
Gets or sets the origin of the grid

Tekla.Structures.Model.GridBase.CoordinateX
Gets or sets the coordinates for the X-axis.

Tekla.Structures.Model.GridBase.CoordinateY
Gets or sets the coordinates for the Y-axis.

Tekla.Structures.Model.GridBase.CoordinateZ
Gets or sets the coordinates for the Z-axis.

Tekla.Structures.Model.GridBase.LabelX
Gets or sets the labels for the X-axis.

Tekla.Structures.Model.GridBase.LabelY
Gets or sets the labels for the Y-axis.

Tekla.Structures.Model.GridBase.LabelZ
Gets or sets the labels for the Z-axis.

Tekla.Structures.Model.GridBase.ExtensionLeftX
Gets or sets the extension to the left X-axis.

Tekla.Structures.Model.GridBase.ExtensionLeftY
Gets or sets the extension to the left Y-axis.

Tekla.Structures.Model.GridBase.ExtensionLeftZ
Gets or sets the extension to the left Z-axis.

Tekla.Structures.Model.GridBase.ExtensionRightX
Gets or sets the extension to the right X-axis.

Tekla.Structures.Model.GridBase.ExtensionRightY
Gets or sets the extension to the right Y-axis.

Tekla.Structures.Model.GridBase.ExtensionRightZ
Gets or sets the extension to the right Z-axis.

Tekla.Structures.Model.GridBase.Color
Gets or sets the color of the grid.

Tekla.Structures.Model.GridBase.Insert
Inserts the grid into the model.
Returns: True on success.

Tekla.Structures.Model.GridBase.Select
Selects the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridBase.Modify
Modifies the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridBase.Delete
Deletes the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.GridBase.CreateInstance
Creates an instance of a grid
Returns: True on success, false otherwise

Tekla.Structures.Model.GridBase.SelectInstance
Selects an instance of a grid
Returns: True on success, false otherwise

Tekla.Structures.Model.GridBase.ModifyInstance
Modifies an instance of a grid
Returns: True on success, false otherwise

Tekla.Structures.Model.GridBase.ToStruct(Tekla.Structures.ModelInternal.dotGrid_t@)
Converts the data of the grid to the struct data that is passed to Core
dotGrid: Struct to be filled

Tekla.Structures.Model.GridBase.FromStruct(Tekla.Structures.ModelInternal.dotGrid_t@)
Converts the data from the struct from Core to this instance of the grid.
dotGrid: Struct to get the data from